
{
  "title":"Syllabus",
  "content":" Course Meeting Times Lectures: 3 sessions / week, 1 hour / session\nRecitations: 1 session / week, 1 hour / session\nPrerequisites Multivariable Calculus (18.02)\nText The readings are assigned in: Strang, Gilbert. Introduction to Linear Algebra. 4th ed. Wellesley-Cambridge Press, 2009. ISBN: 9780980232714.\nReading assignments are also provided for the newer edition: Strang, Gilbert. Introduction to Linear Algebra. 5th ed. Wellesley-Cambridge Press, 2016. ISBN: 9780980232776.\nNOTE: More material on linear algebra (and much more about differential equations) is in Professor Strang\u0026rsquo;s 2014 textbook Differential Equations and Linear Algebra. In 2016, the textbook was developed into a series of 55 short videos, Learn Differential Equations: Up Close with Gilbert Strang and Cleve Moler.\nGoals The goals for 18.06 are using matrices and also understanding them.\nHere are key computations and some of the ideas behind them:\nSolving Ax = b for square systems by elimination (pivots, multipliers, back substitution, invertibility of A, factorization into A = LU) Complete solution to Ax = b (column space containing b, rank of A, nullspace of A and special solutions to Ax = 0 from row reduced R) Basis and dimension (bases for the four fundamental subspaces) Least squares solutions (closest line by understanding projections) Orthogonalization by Gram-Schmidt (factorization into A = QR) Properties of determinants (leading to the cofactor formula and the sum over all n! permutations, applications to inv(A) and volume) Eigenvalues and eigenvectors (diagonalizing A, computing powers A^k and matrix exponentials to solve difference and differential equations) Symmetric matrices and positive definite matrices (real eigenvalues and orthogonal eigenvectors, tests for x\u0026rsquo;Ax \u0026gt; 0, applications) Linear transformations and change of basis (connected to the Singular Value Decomposition - orthonormal bases that diagonalize A) Linear algebra in engineering (graphs and networks, Markov matrices, Fourier matrix, Fast Fourier Transform, linear programming) Homework The homeworks are essential in learning linear algebra. They are not a test and you are encouraged to talk to other students about difficult problems-after you have found them difficult. Talking about linear algebra is healthy. But you must write your own solutions.\nExams There will be three one-hour exams at class times and a final exam. The use of calculators or notes is not permitted during the exams.\nGrading ACTIVITIES PERCENTAGES Problem sets 15% Three one-hour exams 45% Final exam 40% MATLAB® Some homework problems will require you to use MATLAB, an important tool for numerical linear algebra. No previous MATLAB experience is required in 18.06. The related resources section has links to information about MATLAB, including a tutorial.\n"}


